//============================
//
// リザルト画面
// Author:hamada ryuuga
//
//============================

//------------------------
// インクルード
//------------------------
#include "result.h"
#include "input.h"


//========================
// コンストラクター
//========================
CResult::CResult()
{
}
//========================
// デストラクト
//========================
CResult::~CResult()
{
}

//========================
// リザルトの初期化処理
//========================
HRESULT CResult::Init(void)
{
	return S_OK;
}

//========================
// リザルトの終了処理
//========================
void CResult::Uninit(void)
{
	
}

//========================
// リザルトの更新処理
//========================
void CResult::Update(void)
{


}

//========================
// リザルトの描画処理
//========================
void CResult::Draw(void)
{

}